Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ནས། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། མཆོད་པ་བྱས་ནས་སོང་ངོ་། །བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་ནས།
en: Hearing these words, Vajrapāṇi, the great yakṣa general, saluted Noble Avalokiteśvara, the great bodhisattva being, by bowing his head to the Lord’s feet, circumambulated him clockwise three times, and made offerings.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། བྱིས་པའི་ཆ་བྱད་བཟུང་ནས། བཅོམ་ལྡན་འདས་ལ་བསིལ་ཡབ་གཡོབ་པར་བྱེད་བཞིན་དུ་འདུག་གོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས།
en: He then walked over to the blessed Śākyamuni, stood before him holding a yak-tail whisk, and fanned him.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སེམས་དཔའ་ཆེན་པོ་དོན་ཡོད་པ་པདྨ་དྲི་མ་མེད་པ་ཆུ་སྐྱེས་ཀྱི་ཞགས་པའི་སྙིང་པོ་ཞེས་བྱ་བ། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ། རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་། ཕྱག་རྒྱ་དང་། ལྷ་རྣམས་སྨྲོས་ཤིག །
en: The blessed Tathāgata Śākyamuni spoke to the blessed Avalokiteśvara, the great bodhisattva being: “Please pronounce, O great being, this mantra that is sealed by mudrā as the great deity of the maṇḍala, this king of vidyās, the heart essence of Amoghapāśa, that is called the unfailing lotus noose-goad as pure as a lotus!

source: གང་གིས་སྨྲས་པ་ཙམ་གྱིས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིག་གསང་བའི་དཀྱིལ་འཁོར་རིམ་པར་ཕྱེ་བ་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་འདི་རྣམ་པར་དབྱེ་བ་བྱས་པར་འགྱུར་རོ།
en: This teaching alone reveals the secret samayas of all the tathāgata families and their maṇḍalas, mudrās, and mantras.

source: །སྒྲིབ་པ་མེད་པར་དཀྱིལ་འཁོར་མཐོང་བ་ཀུན་ཏུ་གནས་པར་བྱེད་དོ།
en: The maṇḍalas, now uncovered, will remain open to view.

source: །ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་དང་། གསང་སྔགས་དང་། དམ་ཚིག་དང་། ཕྱག་རྒྱ་རྣམས་རྗེས་སུ་མཐུན་པར་ཕྱོགས་ཏེ་གནས་པར་བྱེད་དོ།
en: All the rites, mantras, samayas, and mudrās will be propitious for the vidyā holder.

source: །དཀྱིལ་འཁོར་གྱི་དམ་ཚིག་གི་དེ་ཁོ་ན་ཉིད་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་ལྷ་ཐམས་ཅད་མདུན་ན་ཉེ་བར་གནས་པར་བྱེད་དོ།
en: All the deities of the maṇḍala, the kings of vidyās, will stand by him, true to their samaya.

source: །སྒྲུབ་པའི་དེ་ཁོ་ན་ཉིད་ཀྱི་དངོས་གྲུབ་མཐོང་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་ཕྱིས་ཀྱང་རྣམ་པ་གཞན་དུ་མི་འགྱུར་རོ།
en: His practice will bring genuine accomplishments; it will never again be otherwise.

source: །ལས་ཐམས་ཅད་སྒྲུབ་པའི་ཆོ་ག་རྣམས་ལ་ལེགས་པར་སྒྲུབ་པའི་ཆོ་གར་ཡང་འགྱུར་རོ། །རྟག་ཏུ་རིག་སྔགས་འཆང་གི་རྗེས་སུ་འབྲང་ཞིང་། ཕྱི་བཞིན་ཕྱི་བཞིན་ལྷན་ཅིག་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ་ཞེས་སོ།
en: If the required practice procedures are performed correctly, all his activities will be accomplished, and all the deities, the kings of vidyās, will always accompany him, following close behind.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། བཅོམ་ལྡན་འདས་ཀྱིས་གནང་བར་རིག་ནས།
en: Noble Avalokiteśvara, the great bodhisattva being, listened to this entreaty by the Blessed One.

source: སེམས་ཅན་ཐམས་ཅད་ལ་རྗེས་སུ་བརྩེ་བའི་དོན་དུ། རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་མཆོག་གི་སྒྲུབ་པ་བཀླགས་པས་གྲུབ་པ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོར་ཆེན་པོའི་དབུས་སུ། བཞིན་འཛུམ་ཞིང་མིག་མི་འཛུམས་པས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་སྨྲས་སོ། །དུས་གསུམ་དུ་གཤེགས་ཤིང་བཞུགས་པའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རབ་འབྱམ་ཐམས་ཅད་དང་།
en: Motivated by compassion for all beings and the desire to bring supreme accomplishment to all vidyā holders, the accomplishment that is won through study and practice, he smiled as he pronounced, with an unblinking gaze, the king of vidyās in the presence of the Blessed One, in the midst of the great assembly: “Homage be to all the buddhas and bodhisattvas established throughout the three times!

source: དེ་བཞིན་གཤེགས་པའི་གསང་བའི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་རབ་འབྱམ་རྒྱ་མཚོ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage be to the vast, secret maṇḍala of all the tathāgatas, the mudrās, and the mantras!

source: །འཕགས་པ་རྡོ་རྗེ་འཛིན་པ་རིགས་ཐམས་ཅད་ཀྱི་གསང་བ་དང་། རིག་སྔགས་འཆང་གི་དབང་པོར་བཞུགས་པ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to Noble Vajradhara, the lord of the holders of the secret vidyā of all families!

source: །འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་འཕགས་པ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་རྣམས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all pratyekabuddhas, all noble śrāvakas, and the saṅgha of the past, present, and future!

source: །དཀྱིལ་འཁོར་གྱི་གསང་བ་ཐམས་ཅད་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་པོ་ཆེན་པོའི་སྒྲུབ་པ་གྲུབ་པ་རྣམས་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the great kings of vidyās of the secret maṇḍala who bring the accomplishment of practice.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཐུགས་རྗེ་ཆེན་པོ་ཅན།
en: Homage to Noble Avalokiteśvara, the most compassionate great bodhisattva being!

source: རིག་སྔགས་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་གྱི་རྒྱལ་པོའི་བདག་ཉིད་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པ་གྲུབ་པ་རྣམས་དང་ཕྱག་རྒྱ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །ཏདྱ་ཐཱ། ཨོྃ་བི་མ་ལེ།
en: Homage to the kings of all vidyā maṇḍalas who have accomplished magical amogha powers!

source: བི་མ་ལ་གརྦྷེ།
en: Homage to all the mūdras!

source: བི་མ་ལ་ཨམྦུ་ཛ་པདྨེ་སཱུརྱ་བརྩ་སེ།
en: The king of vidyās is: [313] “Oṁ, pure lotus, innately pure, born in pure water, bright as the sun with one thousand rays, ablaze with a great mass of rays!

source: ས་ཧ་སྲ་རསྨི་ཀི་ར་ཎེ་མ་ཧཱ་ར་སྨི་ཛྭཱ་ལ་ཨ་བ་བྷཱ་ཥི་ཏེ།
en: Act, act!

source: ཙ་ར་ཙ་ར།
en: Act, act!

source: སཉྩ་ར་པདྨོ་ད་རི་པདྨ་གརྦྷེ།
en: Lotus beyond and lotus within!

source: པདྨ་བྷུ་ཛེ།
en: You have two lotus arms.

source: སུ་བི་མ་ལ་ཨམྦུ་ཛ་བི་མ་ལེ་མ་ཎི་ཀ་ཎ་ཀ་བཛྲ་བཻ་ཌཱུརྱ་ཨིནྡྲ་ནཱི་ལ་མ་ར་ཀ་ཏ།
en: Your body, pure as a lotus born in crystal-clear water, is adorned with jewels, gold, diamonds, beryls, sapphires, emeralds, coral, and various other great jewels and gems.

source: པདྨ་རཱ་ག་བི་བི་དྷ་མ་ཧཱ་མ་ཎི་རཏྣཱ་ལྃ་ཀྲྀ་ཏ་ཤ་རཱི་རེ།
en: Hold it, hold, O great lotus holder!

source: མ་ཧཱ་པདྨ་དྷ་ར།
en: Expand, expand, you whose light penetrates everywhere!

source: པ་ར་པ་ར་པ་ར་ཤུ་པཱ་ཤེ་དྷ་ར།
en: You are a recipient of the secret blessing of all the tathāgatas!

source: ས་ར་ས་ར་ས་མནྟ་བཻ་རོ་ཙ་ན།
en: You fulfill the samayas of the families!

source: སརྦ་ཏ་ཐཱ་ག་ཏ་གུ་ཧྱ་ཨདྷིཥྛི་ཏེ།
en: Vara vara!

source: ཀུ་ལ་ས་མ་ཡ་པ་རི་པཱུ་ར་ཎི།
en: You are enveloped by a vajra blaze.

source: བ་ར་བ་ར།
en: O vajra, vajra!

source: བཛྲ་ཛྭཱ་ལ་མཱ་ལཱ་གརྦྷེ།
en: O lotus, blessed by the vajra, hūṁ hūṁ!

source: བཛྲེ་བཛྲེ་བཛྲ་ཨ་དྷིཥྛི་ཏ་པདྨེ་ཧཱུྃ་ཧཱུྃ།
en: O jewel, jewel, great jewel!

source: མ་ཎི་མ་ཎི་མ་ཧཱ་མ་ཎི་ཙིནྟཱ་མ་ཎི་པཱ་ཤ་དྷ་ར།
en: O holder of the wish-fulfilling jewel noose, act, act!

source: ཧུ་རུ་ཧུ་རུ་པདྨ་པདྨ་གཽ་རེ་པདྨ་པཱ་ཎི་བར་དེ།
en: O lotus, lotus-white! You hold a lotus in one hand and display the boon-granting mudrā with the other.

source: ཨ་མོ་གྷ་པདྨེ།
en: O amogha lotus!

source: ཨོྃ་པདྨི་ནི་པདྨ་མ་ཎི་བཛྲ་དྷ་རཱ།
en: Oṁ, lotus lady, holder of a lotus, jewel, and vajra scepter!

source: སརྦ་ཏ་ཐཱ་ག་ཏ་ཀུ་ལ་སཱ་ནཱ་མྱ་ས་མ་ཡ་ཨ་དྷིཥྛི་ཏེ།
en: You are established in the samaya bond with all tathāgata families equally.

source: མ་ཧཱ་བི་པུ་ལ་བྷུ་ཛེ།
en: You whose arms have a wide reach, carry, carry!

source: སམྦྷ་ར། བྷུ་རུ་བྷུ་རུ་བྷུ་རི་ཎི།
en: Bhuru bhuru, bhūraṇi!Bhiri bhiri, O king of vidyās with panoptic vision!

source: བྷི་རི་བྷི་རི།
en: Expand, expand!

source: ས་མནྟ་ཨ་བ་ལོ་ཀི་ཏ་བཱིརྱ་རཱ་ཛེ་པྲ་ས་ར་པྲ་ས་ར་སནྟ་བི་མ་ལེ།
en: O pure expanse!

source: སརྦ་བིདྱཱ་མཎྜ་ལ་དེ་བ་ཏཱ་ན་མ་སྐྲྀ་ཏེ།
en: You are honored by all the deities of the vidyā maṇḍala.

source: ཏ་ར་ཏ་ར།
en: Cross, cross!

source: ཏཱ་ར་ཡ་ཏཱ་ར་ཡ།
en: Rescue, rescue! You make everything complete.

source: ས་མནྟ་པ་རི་པཱུ་ར་ཎི་སརྦ་བོ་དྷི་སཏྭ་ཨ་བྷི་ཥེ་ཙ་ནི་སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་མོ་གྷ་ཨ་བྷི་ཥིཀྟ་ཨ་བྷི་ཥིཉྩ་ཡ་ས་མཾ་སརྦ་བིདྱཱ་མཎྜ་ལ་ཀུ་ལ།
en: You consecrate all bodhisattvas and are yourself amogha-consecrated by all the tathāgatas.

source: ས་མ་ཡ་ཨ་བྷི་ཥེ་ཀཻཿསརྦ་ཏ་ཐཱ་ག་ཏ་པཱ་ཎི་བར་དེ།
en: Please consecrate me!

source: པདྨ་གཽ་རེ་པདྨ་པྲ་བྷེ།
en: You are invested with the samaya of all the families of vidyā maṇḍalas. Your hand displays the boon-granting mudrā of all the tathāgatas.

source: པདྨ་བི་ཀ་ཙམྦུ་ཛ་གརྦྷེ།
en: O lotus white, lotus hued, you are like the interior of a half-opened lotus, hūṁ hūṁ!

source: ཧཱུྃ་ཧཱུྃ།
en: O vajra, vajra!

source: བཛྲེ་བཛྲེ།
en: O vajra, O lotus, blessed by tathāgata families!

source: བཛྲེ་པདྨེ་ཏ་ཐཱ་ག་ཏ་ཀུ་ལ་ཨ་དྷིཥྛི་ཏེ།
en: You grant amogha boons.

source: ཨ་མོ་གྷ་བ་ར་དེ།
en: You fulfill all wishes.

source: སརྦཱ་སཱ་པ་རི་པཱུ་ར་ཎི་སརྦ་པཱ་པ་དུཿཁ་པྲ་ཤ་མ་ནི།
en: You pacify all evil and all suffering.

source: ཨ་མོ་གྷ་ཧྲྀ་ད་ཡ་སིདྡྷི་སཱ་དྷ་ཡ་བི་མ་ལེ་ཧཱུྃ་ཕཊ།
en: Please bring the accomplishment of the amogha essence! O pure being, hūṁ phaṭ!

source: ཨོྃབ་ར་དེ་པདྨ་བྷུ་ཛེ་ན་མ་སྟུ་ཏེ་པདྨ་སུ་ཏེ་སྭཱ་ཧཱ།
en: Oṁ, granter of boons with lotus-like arms, homage be to you! O inner lotus space,svāhā!”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། དོན་ཡོད་པ་དྲི་མ་མེད་པ་པདྨོའི་ཆུ་སྐྱེས་ཀྱི་པདྨའི་ལྕགས་ཀྱུ་དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་རིགས་ཀྱི་རྒྱལ་པོ་གཟུངས་ཆེན་པོ་ཀུན་ནས་རྣམ་པར་སྣང་བར་བྱེད་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐུན་མོང་གི་རིགས་ཀྱི་དམ་ཚིག་གི་ཕྱག་རྒྱའི་སྙིང་པོ་འདི་སྨྲས་པའི་དེ་མ་ཐག་གི་འོག་ཏུ་པདྨ་ཟེ་འབྲུ་དང་བཅས་པའི་གེ་སར་གསལ་བར་རྣམ་པར་བྱེ་སྟེ། དཔེར་ན་གྲོང་ཁྱེར་གྱི་ཕྱོགས་གཅིག་གི་སྒོ་བྱ་ནས་རྒྱལ་མོ་བྱུང་བ་བཞིན་དུ། ལྷའི་གཟུགས་བལྟ་ན་སྡུག་པ་འོད་མཐའ་ཡས་པ་ཕྱག་བཞི་པ་རྒྱན་གྱིས་རྣམ་པར་བརྒྱན་པ།
en: As soon as the great dhāraṇī—the king of vidyās, the unfailing lotus noose-goad as pure as a lotus, the heart essence of Amoghapāśa, the essence of the samaya mudrā of the sameness of all tathāgata families whose light penetrates everywhere—was pronounced by the noble bodhisattva Avalokiteśvara, the aforementioned lotus, complete with pericarp and filaments, opened fully like a gate in the city walls, and from it emerged a queen who had four arms, was adorned with every ornament, and displayed a divine form of infinite brightness.

source: ཕྱག་ན་པདྨ། དོན་ཡོད་ཞགས་པའི་ངོ་བོའི་ཞགས་པའི་ཕྱག་དང་། ཡིད་བཞིན་གྱི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཆེན་པོའི་ཕྱག་དང་། མདུང་རྩེ་གསུམ་པའི་ཕྱག །
en: Taking the form of Amoghapāśa, she held a lotus, a noose, a great jeweled banner crowned with a great wish-fulfilling jewel, and a trident.

source: སྤྱན་གསུམ་པ། ཞལ་གསུམ་པ་ཟླ་བའི་ཅོད་པན་འཆང་བ་ཞི་བ།
en: She had three faces, each with three eyes and crested with a crescent moon.

source: ཞི་ཞིང་འཛུམ་པའི་ཞལ།
en: She was of a peaceful and gentle aspect, with a smile on her face.

source: སྐུ་ལ་འོད་ཟེར་སྣ་ཚོགས་འབར་བའི་སྙིང་པོ།
en: Her body, permeated with inner light, emitted rays of light of various colors.

source: པདྨ་དང་། སེང་གེའི་གདན་ལ་བཞུགས་པ། པདྨ་ཁ་བྱེ་བའི་སྙིང་པོར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Seated on an open lotus supported by lions, she stood up before the Blessed One and paid homage to him, bowing her head to his feet.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། མགོ་བོས་ཕྱག་འཚལ་ཞིང་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ།
en: She circumambulated him clockwise three times and, bowing her head low, stopped in front of the Blessed One with folded hands.

source: མིག་མི་འཛུམས་པར་བལྟ་ཞིང་འཁོད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས།
en: She remained like this, gazing at the Blessed One with unblinking eyes.

source: དོན་ཡོད་པ་པདྨ་དྲི་མ་མེད་པ་ཆུ་སྐྱེས་ཀྱི་ཞགས་པའི་ལྕགས་ཀྱུ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་བུད་མེད་ཀྱི་གཟུགས་འཛིན་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སེམས་ཅན་དག་པ་ཆེན་པོ་ཁྱོད་ཅིའི་ཕྱིར་མིག་མི་འཛུམས་པར་བལྟ།
en: The blessed Tathāgata Śākyamuni asked Unfailing Lotus Noose-Goad as Pure as a Lotus, the king of vidyās who had assumed a female form, “Why are you gazing at me, O pure being, with unblinking eyes?

source: མཆོག་ཅི་དོན་དུ་གཉེར་བཞིན་དུ་འཁོད་ཅེས་སོ།
en: Why, O deity, do you keep supplicating me?”

source: །རིག་སྔགས་ཀྱི་རྒྱལ་མོས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་རྣམས་ཀྱི་སྤྱིའི་ཕྱག་རྒྱ་དང་།
en: The king of vidyās replied, “May I realize, O Blessed One, the sameness of the secret maṇḍalas of all tathāgatas!

source: སྔགས་དང་། དམ་ཚིག་གསང་བའི་རྗེས་སུ་འཇུག་པར་བགྱིའོ།
en: May I gain insight into the secret mudrās, mantras, and samayas they share!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཉོན་ཅིག །
en: The Blessed One replied, “Listen, great king of vidyās!

source: ཁྱོད་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་དུ། དམ་ཚིག་གི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱའི་གསང་བར་ལུང་བསྟན་ཅིང་། ཁྱོད་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱིས་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་ལུང་བསྟན་ནོ།
en: You have been prophesied by all the tathāgatas, including the Tathāgata Vairocana, who is the chief of every maṇḍala, to be the all-secret seal of the samaya maṇḍala.

source: །ངས་ཀྱང་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་དང་། དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱའི་དམ་ཚིག་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར་བར་ལུང་བསྟན་ནོ། །ཏུཎྜཱ་དང་། ཀར་ཤམ་དང་། སྒྲོལ་མ་དང་། ཁྲོ་གཉེར་ཅན་དང་། པདྨ་རིགས་མཛེས་མ་དང་།
en: I, too, declare that, as far as all the secret maṇḍalas, mudrās, and samayas of all tathāgatas are concerned, you are foremost.

source: ལྷ་མོ་ཆེན་མོ་ཀི་ལཱི་ཀི་ལཱི་དང་། རྡོ་རྗེ་ཕོ་ཉ་མོ་དང་། དྲི་མེད་བྱེད་མ་དང་། པདྨའི་སྤྱན་མ་དང་། རྡོ་རྗེ་ལུ་གུ་རྒྱུད་མ་དང་། རྡོ་རྗེ་ཁྲོ་གཉེར་ཅན་
en: You are Tuṇḍā, Śvetā, Tārā, Bhṛkuṭī, Padmasundarī, Kelikilī, Mahādevī, Vajradūtī, Vimalākarī, Padmanetrī, Vajraśaṅkalī, the goddess Vajrabhṛkuṭikā, Padma­prabhāsinī, Padmacāriṇī, the great vidyārājñī Amogha­padma­hastā, Bhogavatī, Śrī, Bhīmā, Anaupamyā, and Sarasvatī.

source: དང་། ལྷ་མོ་པདྨ་རབ་སྣང་མ་དང་། པདྨ་སྤྱོད་བྱེད་མ་དང་། རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་མོ་དོན་ཡོད་པའི་ཕྱག་དང་། ལོངས་སྤྱོད་ལྡན་མ་དང་། དཔལ་མོ་དང་། འཇིགས་མ་དང་། དཔེ་མེད་མ་དང་། དབྱངས་ཅན་མ་དང་། རལ་གཅིག་མ་སྤྱན་སྟོང་པ། ཕྱག་སྟོང་པ། དབུ་སྟོང་པ།
en: You are Ekajaṭī with one thousand eyes, one thousand arms, and one thousand heads.

source: དོན་ཡོད་པའི་པདྨ་དང་། རིན་ཆེན་ལྷ་མོ་དང་།
en: You are Amoghapadmā, Caralā, and the goddess Ratnā.

source: རིན་ཆེན་འབྱུང་གནས་དང་། འཇིག་རྟེན་དབང་ཕྱུག་ཉིད་དང་། རིག་པའི་དབང་ཕྱུག་ཉིད་དང་།
en: You are the lokeśvara who is the master of vidyās and a source of jewels.

source: ལྷ་མོ་ཆེན་མོ་ཕྱག་རྒྱའི་དབང་ཕྱུག་དང་། རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་མོ་དང་།
en: You are a great goddess, the lady of the mudrās, and the maṇḍala goddess of the families.

source: ཧུ་ཧྭ་བཟླས་པའི་སྦྱིན་སྲེག་དང་། ཞི་བའི་ལས་དང་། ལྷ་མོ་རིགས་མཛེས་མ་དང་།
en: You are the deity of the activity of pacifying, propitiated through mantra recitation and homa offerings. “

source: རིག་སྔགས་འཆང་ཆེན་མོ་རྡོ་རྗེ་མཛེས་མ་ཉིད་དང་། ཕྱག་ན་འཁོར་ལོ་གྲུབ་པ་དང་།
en: You are the great vidyā Kulasundarī, and you are Vajrasundarī.

source: དེ་བཞིན་དུ་རལ་གྲི་བཟང་པོའི་རིག་པ་འཛིན་པ་དང་། ཁྲོ་བོ་ཉིད་དང་།
en: You are a discus holder, a goddess who carries a sword, and a sword vidyādharī.

source: ཁྲོ་བོའི་རྒྱལ་པོ་དང་། དུས་ཀྱི་མཚན་མོ་དང་། ཞལ་རྣམ་པར་འགྱུར་མ་དང་། མཆེ་བ་གཙིགས་མ་དང་། སེར་སྐྱ་མ་ཉིད་དང་།
en: You are the wrathful Krodharāja, and you are Kālarātrī with a grimacing face and protruding, bared fangs.

source: རང་གསལ་མ་དང་།
en: You are Piṅgalī, and you are Svakāśi.

source: ཕྱག་ན་རིན་ཆེན་མ་ཉིད་དང་། སའི་དཀྱིལ་འཁོར་གྱི་ལྷ་མོ་དང་།
en: You are a jewel holder and the goddess of the entire earth.

source: དེ་བཞིན་དུ་རྫས་ཡོངས་སུ་འཛིན་པའི་ལྷ་མོ་དང་། མཆོད་ཡོན་དང་།
en: You are the deity who procures power substances.

source: ཞབས་བསིལ་དང་། གཏོར་མ་ཉིད་ཀྱི་ལྷ་དང་།
en: You are the chief deity of the offering of argha water for the feet and of the bali offering.

source: ཨ་གྲི་ཎི་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། ཕྲེང་བ་དང་། བྱུག་པའི་ལྷ་དང་།
en: You are the deity of perfume, flowers, incense, garlands, and scented oils.

source: ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བའི་ལྷ་མོ་ཁྱོད་དང་། གསང་སྔགས་ཐམས་ཅད་ལ་དབང་སྒྱུར་མ་དང་།
en: You are an omnipresent goddess who is behind the enthralling power of every mantra. “

source: བུད་མེད་ཀྱི་གཟུགས་འཛིན་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་མཆོག་སྒྲོལ་བར་བྱེད་པ་དང་།
en: You are the chief king of vidyās in female form.

source: བདག་གི་གསང་སྔགས་ཐམས་ཅད་འཛིན་པའི་རིག་སྔགས་ཀྱི་རྒྱལ་མོའི་མཆོག་མ་དང་།
en: You are the keeper of all mantras that contain the plea ‘Please rescue me!’

source: རིག་སྔགས་འཆང་གི་དབང་མོ་དང་།
en: You are the chief king of vidyās and the patron goddess of all vidyā holders.

source: རིགས་ཀྱི་གསང་སྔགས་དང་།
en: You are the secret mantra of all families taught by all tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་རིག་སྔགས་ཀྱི་རྒྱལ་མོ་ཆེན་པོ་ངེས་པར་སྦྱིན་པ་འཇིག་རྟེན་དབང་ཕྱུག་སྐྱེས་པ་ཉིད་དུ་དཔྲལ་བའི་སྨིན་མའི་བར་དུ་ལྷའི་ཆུའི་དངུལ་ལས་ངེས་པར་སྐྱེས་ཤིང་བྱུང་བ།
en: You are a great king of vidyās, a perfect priest, and a lokeśvara. You are the goddess born from a drop of sweat between the eyebrows of Avalokiteśvara.

source: སྐར་མའི་རྣམ་པ་དང་མཚུངས་པ།
en: You emerged from it resembling a star in form and appearance.

source: སྣ་ཚོགས་པའི་གཟུགས་ཅན་དུ་གྱུར་པའོ།
en: Be the bearer of all forms, O Sarasvatī, the performer of all activities! “

source: །ཞེས་ལས་སྣ་ཚོགས་དང་། དབྱངས་ཅན་གང་ཡིན་པ་འདི་འཆང་བར་བྱེད་དོ། །ཞེས་དེ་བཞིན་གཤེགས་པས་ལུང་བསྟན་པ་དང་དུ་བླངས་ནས་གསུངས་སོ།
en: Whoever upholds these names will receive a prophecy from all the tathāgatas about his future awakening.

source: །རིག་སྔགས་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་མཉམ་པར་སྐྱོབ་པ་ཐོབ་པ་དང་།
en: Or, if he rises at daybreak and recites these names, he will win the accomplishment of all vidyās.

source: དེ་བཞིན་དུ་ཆོ་ག་ཞིབ་མོའི་སྒྲུབ་པ་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་རྣམ་པ་སྣ་ཚོགས་པ་དང་། དོན་ཡོད་པའི་དངོས་གྲུབ་ཀྱང་ཐོབ་པར་བྱེད་དོ།
en: He will obtain various accomplishments and accomplish all mantras, mudrās, and ritual procedures.

source: །དོན་ཡོད་པའི་འབྲས་བུ་མཐོང་བ་དང་།
en: He will obtain the amogha accomplishment and will manifest amogha results.

source: བཀླགས་པས་གྲུབ་པའི་རྒྱུ་མཚན་གཞན་དང་།
en: He will display signs of scholarly accomplishments, in addition to other signs.

source: ཐམས་ཅད་དུ་རིགས་སྤྱིའི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱའི་དངོས་གྲུབ་ཀྱི་ཕྱིར་དང་།
en: He will accomplish every aspect of the maṇḍalas and mudrās shared by all the families.

source: སྤྱིའི་དཀྱིལ་འཁོར་དང་ཕྱག་རྒྱའི་དམ་ཚིག་ཉིད་ཀྱང་འདི་དྲན་པ་ཙམ་གྱིས་ཐམས་ཅད་ཐོབ་པར་བྱེད་དོ།
en: He will both accomplish the maṇḍala-seal shared by them and create the samaya bond with those families. “

source: །དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། ལྷ་དེ་དག་ཐམས་ཅད་ཀྱང་དྲན་པ་ཙམ་གྱིས་རྗེས་སུ་འབྲང་བར་འགྱུར་བར་ཐེ་ཙོམ་མེད་དོ།
en: By merely remembering this king of vidyās, all the maṇḍala, mantra, and mudrā deities will arrive. They will all remain close by, merely through this act of remembering them; there is no doubt about this.

source: །རིག་སྔགས་ཀྱི་རྒྱལ་པོའི་དཀྱིལ་འཁོར་དང་ལྷ་རྣམས་དམ་ཚིག་ལ་ཀུན་ཏུ་གནས་པར་བྱེད་དོ།
en: All the deities from the maṇḍala of the king of vidyās will keep their samaya.

source: །དེ་ལྟ་བས་ན། འབད་པ་ཐམས་ཅད་ཀྱིས་ཟུང་ཅིག །དེ་བཞིན་དུ་ཐུབ་པ་རྣམ་པར་སྣང་མཛད་དང་། ཤཱཀྱའི་རྒྱལ་པོས་རིག་སྔགས་ཀྱི་རྒྱལ་པོར་ལུང་བསྟན་པ།
en: For that reason, the vidyā holder should make every effort to uphold the king of vidyās that was taught by the king of the Śākyas and by the sage Vairocana.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་མིང་ཀུན་ཏུ་གཟིགས་ཤིང་ཐམས་ཅད་དུ་རྗེས་སུ་འགྲོ་བ་སྟེ།
en: Such a vidyā holder will be watched over by all the tathāgatas, who will also follow him.

source: དེའི་ཕྱིར་སྤྱན་རས་གཟིགས་པདྨ་ཞེས་བྱ་བ་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་བླ་ན་མེད་པ།
en: Therefore, this deity, Avalokitapadmā, is the supreme king of vidyās. “

source: རྡོ་རྗེའི་དངོས་གྲུབ་དངོས་གྲུབ་ཆེན་པོ། པདྨའི་རིགས་ཀྱི་དངོས་གྲུབ་བླ་ན་མེད་པ།
en: This king of vidyās grants the supreme, great accomplishments of the vajra and lotus.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་དངོས་གྲུབ་སྒྲུབ་པ་གྲུབ་པ། དཀྱིལ་འཁོར་ཆེན་པོའི་རིགས་དང་ནོར་བུ་ཆེན་པོའི་རིགས་ཀྱི་དམ་ཚིག་གི་དངོས་གྲུབ་སྒྲུབ་པ་གྲུབ་པ།
en: It grants the accomplishment of the tathāgata family, the accomplishment of the great families of the maṇḍala, and the accomplishment of the great jewel family. It grants the accomplishment of the samaya of these families.

source: དོན་ཡོད་པའི་སྙིང་པོའི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་མཆོག་གི་དངོས་གྲུབ།
en: It grants the accomplishment of magical powers and the supreme accomplishment of the entire maṇḍala that constitutes the essence of Amoghapāśa. “

source: མཆོག་གི་དང་པོ་རྡོ་རྗེའི་རིགས་སུ་བསྟན་པ། རྡོ་རྗེ་རྩེ་མོ་ཆེན་པོའི་ལྷ་དང་། དེ་བཞིན་དུ་རྡོ་རྗེ་ས་འོག་དངོས་གྲུབ་ཀྱི་ཕྱིར་རྡོ་རྗེ་ཕྲེང་བ་རིམ་པར་ཕྱེ་བའི་གྲངས་དང་རྡོ་རྗེ་མཆུའི་མཆོག་གི་དངོས་གྲུབ་རྣམས་ལ་སྤྱན་རས་གཟིགས་པདྨ་དང་། པདྨ་མཛེས་པ་དང་།
en: The vidyā holder will win the supreme accomplishments that arise in the vajra family: those of the divine vajra peak, vajra underground, and vajra garland are considered a group.

source: དེ་བཞིན་དུའམ། མིང་སྨོས་པ་ཙམ་གྱི་མོད་ལ་རྗེས་སུ་འབྲང་ཞིང་འོང་བར་བྱེད་དོ། །དེ་བཞིན་དུ་རྡོ་རྗེ་དབང་པོ་དང་། རྡོ་རྗེ་འཛིན་པ་དང་། ལག་ན་རྡོ་རྗེ་དང་།
en: As soon as he mindfully repeats the names of Avalokitapadmā or Padmasundarī, she will immediately arrive and stand by him, as will the vajra lord, the vajra bearer, the great lord Vajrapāṇi.

source: དབང་ཕྱུག་ཆེན་པོ་རྣམས་རྟག་ཏུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ།
en: They will stand by him continually.

source: །དེ་ལྟ་བས་ན། རྟག་ཏུ་ཤེས་པས་རིག་སྔགས་སྨྲ་བ་དང་། མིང་གང་གི་མཆོག་འཛིན་པ་ལ།
en: Therefore, the wise propounder of vidyā should always uphold the supreme name.

source: དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་རྣམ་པར་གཟིགས་པར་འགྱུར་རོ། །དེ་བཞིན་ཉིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་།
en: All the tathāgatas and all the bodhisattvas will continually watch over such a vidyā holder, and the sage Vairocana will certainly prophesy his future awakening.

source: ཐུབ་པ་རྣམ་པར་སྣང་མཛད་ཀྱིས་རྟག་ཏུ་ལུང་སྟོན་པར་འགྱུར་བར་ཐེ་ཚོམ་མེད་དོ།
en: There is no doubt about this.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་རིག་སྔགས་ཀྱི་རྒྱལ་པོ་འདི་ལུང་བསྟན་མ་ཐག་ཏུ་ས་རྣམ་པར་འགྱུར་བ་དྲུག་ཏུ་གཡོས་སོ། །གཡོས་རབ་ཏུ་གཡོས། འགུལ་རབ་ཏུ་འགུལ། ལྡེག་རབ་ཏུ་ལྡེག །འུར་འུར་རབ་ཏུ་འུར་འུར། ཆེམ་ཆེམ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །ལྷའི་མེ་ཏོག་གི་ཆར་བབ་སྟེ། འདི་ལྟ་སྟེ། ཟླ་བ་མདོག་མཛེས་དང་། དྲི་མེད་མདོག་མཛེས་དང་། མདོག་མཛེས་ཆེན་པོ་དང་། མནྡཱ་ར་བ་དང་། མནྡཱ་ར་བ་ཆེན་པོ་དང་། པདྨ་དང་། ཀུ་མུ་ད་དང་། པདྨ་དཀར་པོ་དང་། ཨུཏྤལ་སྔོན་པོ་དང་། ཨུཏྤ་ལ་དམར་པོ་དང་། མྱ་ངན་འཚང་དང་། སྐྱ་ནར་དང་། པུནྣཱ་ག་དང་། གནྡྷ་ག་པཱརྵི་ཀ་དང་། ཀོནྟ་དང་། ཨ་དྷི་མུཀྟ་ཀ་དང་། པ་ལཱ་ཤ་དང་།
en: As soon as the Blessed One gave this teaching on the king of vidyās, the earth quaked in six different ways: it quaked gently and violently, shook gently and violently, and trembled gently and violently.

source: མཐོན་ཀ་དང་། མཐོན་ཀ་ཆེན་པོ་དང་། ཙམྤ་ཀ་དང་། སཽ་གནྡྷི་ཀ་དང་། སནྡྷ་བཱ་ར་ཎ་དང་། ནཱ་ག་པུཥྤ་དང་། སྣ་མ་དང་།
en: It hummed softly and loudly, and it rumbled softly and loudly.

source: ཡཱུ་ཐི་ཀ་དང་། ན་བ་མཱ་ལི་ཀ་དང་། ཏ་ར་ཎ་དང་། མ་རུ་བ་ཀ་དང་། ཀུ་བྱ་ཀའི་མེ་ཏོག་གི་ཆར་འབབ་པའི་དོན་དང་།
en: A rain of divine flowers fell, flowers such as candraroca, vimalaroca, mahāroca, the flowers of the coral tree and great coral tree, white, pink, red, and blue lotuses and water lilies, the blossoms of the aśoka tree and the trumpet-flower tree, punnāga flowers, fragrant jasmine flowers, kontā flowers, adhimuktaka flowers, the blossoms of flame-of-the-forest, indigo flowers, mahānīla flowers, champak blossoms, and the flowers of saugandhika, siddhavāriṇa, nāgapuṣpa, sumanas, pūrvika, navamallikā, taraṇa, maruvaka and kupyaka.

source: ཚོན་རྩི་སྣ་ཚོགས་པས་བཙོས་པའི་ལྷའི་གོས་ཀྱི་ཆར་འབབ་པའི་དོན་དང་།
en: It rained divine garments of various beautiful colors.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ལྷའི་རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། རྒྱན་ཆའི་ཆར་འབབ་པའི་དོན་དང་།
en: It rained divine ornaments, adornments, jewelry, and the seven precious jewels.

source: ལྷའི་གསེར་གྱི་མེ་ཏོག་གི་ཆར་འབབ་པའི་དོན་དང་། ལྷའི་དྲི་ཙནྡན་དང་། ཏ་མཱ་ལ་དང་།
en: It rained divine golden flowers.

source: ག་པུར་དང་། གླ་རྩི་དང་། གུར་གུམ་དང་། ལྷའི་གོས་དང་། དྲི་བཟང་པོས་བསྒོས་པའི་ཕྱེ་མའི་ཆར་འབབ་པའི་དོན་དང་།
en: It rained divine fragrant substances such as sandalwood, tamāla, camphor, musk, saffron, and other divine perfumes and scented powders.

source: ལྷའི་དྲི་ཆབ་ཀྱི་ཆར་འབབ་པའི་དོན་དང་།
en: It rained divine perfumed water.

source: མ་དཀྲོལ་བར་ནམ་མཁའི་མཐིལ་དུ་རོལ་མོའི་སྒྲ་འབྱུང་བ་དང་།
en: Musical instruments played without being touched.
